status/2022/0506.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-07 Sat 06:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>30 April 2022 - 06 May 2022</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Daniel Kelley" />
</head>
<body>
<div id="content">
<h1 class="title">30 April 2022 - 06 May 2022</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9c74161">1. MIT OCW</a>
<ul>
<li><a href="#org7656aca">1.1. 18.02 - Multiple Variable Calculus</a>
<ul>
<li><a href="#orge4aa37d">1.1.1. Continue PS7</a></li>
</ul>
</li>
<li><a href="#org759fcff">1.2. 8.01X+8.01L - Physics I - Classical Mechanics with Labs</a>
<ul>
<li><a href="#org6e3de3a">1.2.1. Started Problem Set 2</a></li>
<li><a href="#orgce25dc0">1.2.2. Planning experiment to measure 'g'</a></li>
</ul>
</li>
<li><a href="#orgc1dc452">1.3. 21G.701 Spanish</a>
<ul>
<li><a href="#orgeee65c2">1.3.1. Finished Episodes 30-31 (no progress this week)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga730ece">2. Mill Controller #2</a>
<ul>
<li><a href="#org3794951">2.1. Potential for using old Compaq iPaq boards.</a></li>
<li><a href="#org7242b6d">2.2. May use OLPC in the meantime.</a></li>
<li><a href="#org5dc9a7a">2.3. Still having problems with mill controller booting reliably.</a></li>
</ul>
</li>
<li><a href="#org67c32c1">3. OLPC</a>
<ul>
<li><a href="#org6c97382">3.1. Needs ML1120 coin batteries to fix "invalid system date".</a></li>
</ul>
</li>
<li><a href="#org45e5cc4">4. Virtual Orchestra</a>
<ul>
<li><a href="#orgf831480">4.1. Continued Bolero coding</a></li>
<li><a href="#orgbaca0d6">4.2. Initial playback using fluidsynth</a></li>
<li><a href="#orgfa966a8">4.3. Audio via liquidsfz</a></li>
</ul>
</li>
<li><a href="#org9e65a83">5. Audio Distribution</a></li>
<li><a href="#org2074a38">6. Quilting Frame Desk</a>
<ul>
<li><a href="#org62a35f8">6.1. Top sanded.</a></li>
<li><a href="#orga04df2c">6.2. Two leg brackets need rework.</a></li>
</ul>
</li>
<li><a href="#org3ebdb6a">7. David Davies</a>
<ul>
<li><a href="#org87b6f83">7.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#org8288a2d">7.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#org10eb153">7.3. Next hearing 4/29/2022.</a></li>
<li><a href="#org128f365">7.4. Court Records don't appear to be updated.</a></li>
</ul>
</li>
<li><a href="#org9015a6e">8. Peter Kim</a>
<ul>
<li><a href="#orgc03d47f">8.1. Broadcom CSG Employee indicted for trade secret theft.</a></li>
<li><a href="#org152646b">8.2. United States v. Kim (5:21-cr-00438).</a></li>
<li><a href="#org5010094">8.3. Change of Plea Hearing set for 5/31/2022</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9c74161" class="outline-2">
<h2 id="org9c74161"><span class="section-number-2">1</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org7656aca" class="outline-3">
<h3 id="org7656aca"><span class="section-number-3">1.1</span> 18.02 - Multiple Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orge4aa37d" class="outline-4">
<h4 id="orge4aa37d"><span class="section-number-4">1.1.1</span> Continue PS7</h4>
</div>
</div>
<div id="outline-container-org759fcff" class="outline-3">
<h3 id="org759fcff"><span class="section-number-3">1.2</span> 8.01X+8.01L - Physics I - Classical Mechanics with Labs</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org6e3de3a" class="outline-4">
<h4 id="org6e3de3a"><span class="section-number-4">1.2.1</span> Started Problem Set 2</h4>
</div>
<div id="outline-container-orgce25dc0" class="outline-4">
<h4 id="orgce25dc0"><span class="section-number-4">1.2.2</span> Planning experiment to measure 'g'</h4>
</div>
</div>
<div id="outline-container-orgc1dc452" class="outline-3">
<h3 id="orgc1dc452"><span class="section-number-3">1.3</span> 21G.701 Spanish</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgeee65c2" class="outline-4">
<h4 id="orgeee65c2"><span class="section-number-4">1.3.1</span> Finished Episodes 30-31 (no progress this week)</h4>
</div>
</div>
</div>
<div id="outline-container-orga730ece" class="outline-2">
<h2 id="orga730ece"><span class="section-number-2">2</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org3794951" class="outline-3">
<h3 id="org3794951"><span class="section-number-3">2.1</span> Potential for using old Compaq iPaq boards.</h3>
</div>
<div id="outline-container-org7242b6d" class="outline-3">
<h3 id="org7242b6d"><span class="section-number-3">2.2</span> May use OLPC in the meantime.</h3>
</div>
<div id="outline-container-org5dc9a7a" class="outline-3">
<h3 id="org5dc9a7a"><span class="section-number-3">2.3</span> Still having problems with mill controller booting reliably.</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Needs a new RTC battery.
</p>
</div>
</div>
</div>
<div id="outline-container-org67c32c1" class="outline-2">
<h2 id="org67c32c1"><span class="section-number-2">3</span> OLPC</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org6c97382" class="outline-3">
<h3 id="org6c97382"><span class="section-number-3">3.1</span> Needs ML1120 coin batteries to fix "invalid system date".</h3>
</div>
</div>
<div id="outline-container-org45e5cc4" class="outline-2">
<h2 id="org45e5cc4"><span class="section-number-2">4</span> Virtual Orchestra</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgf831480" class="outline-3">
<h3 id="orgf831480"><span class="section-number-3">4.1</span> Continued Bolero coding</h3>
</div>
<div id="outline-container-orgbaca0d6" class="outline-3">
<h3 id="orgbaca0d6"><span class="section-number-3">4.2</span> Initial playback using fluidsynth</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Awful, unless you <b>wanted</b> the bass clarinets to sound like farts.
</p>
</div>
</div>
<div id="outline-container-orgfa966a8" class="outline-3">
<h3 id="orgfa966a8"><span class="section-number-3">4.3</span> Audio via liquidsfz</h3>
<div class="outline-text-3" id="text-4-3">
<p>
"batch" renderer partially completed
</p>
</div>
</div>
</div>
<div id="outline-container-org9e65a83" class="outline-2">
<h2 id="org9e65a83"><span class="section-number-2">5</span> Audio Distribution</h2>
<div class="outline-text-2" id="text-5">
<p>
Distributing audio in SCZ from office to family room. Using icecast as
server and a raspberry pi zero W as client (with mplayer). Most fiddly
part was feeding icecast with audio via 'jack'. After trying numerous
approaches (mixxx, butt, ezstream, vlc); settled on vlc. RPi still needs
some sort of screensaver that doesn't kill audio.
</p>
</div>
</div>
<div id="outline-container-org2074a38" class="outline-2">
<h2 id="org2074a38"><span class="section-number-2">6</span> Quilting Frame Desk</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org62a35f8" class="outline-3">
<h3 id="org62a35f8"><span class="section-number-3">6.1</span> Top sanded.</h3>
</div>
<div id="outline-container-orga04df2c" class="outline-3">
<h3 id="orga04df2c"><span class="section-number-3">6.2</span> Two leg brackets need rework.</h3>
</div>
</div>
<div id="outline-container-org3ebdb6a" class="outline-2">
<h2 id="org3ebdb6a"><span class="section-number-2">7</span> David Davies</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org87b6f83" class="outline-3">
<h3 id="org87b6f83"><span class="section-number-3">7.1</span> Broadcom BCG? Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-org8288a2d" class="outline-3">
<h3 id="org8288a2d"><span class="section-number-3">7.2</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-org10eb153" class="outline-3">
<h3 id="org10eb153"><span class="section-number-3">7.3</span> Next hearing 4/29/2022.</h3>
</div>
<div id="outline-container-org128f365" class="outline-3">
<h3 id="org128f365"><span class="section-number-3">7.4</span> Court Records don't appear to be updated.</h3>
</div>
</div>
<div id="outline-container-org9015a6e" class="outline-2">
<h2 id="org9015a6e"><span class="section-number-2">8</span> Peter Kim</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgc03d47f" class="outline-3">
<h3 id="orgc03d47f"><span class="section-number-3">8.1</span> Broadcom CSG Employee indicted for trade secret theft.</h3>
</div>
<div id="outline-container-org152646b" class="outline-3">
<h3 id="org152646b"><span class="section-number-3">8.2</span> United States v. Kim (5:21-cr-00438).</h3>
</div>
<div id="outline-container-org5010094" class="outline-3">
<h3 id="org5010094"><span class="section-number-3">8.3</span> Change of Plea Hearing set for 5/31/2022</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2022-05-07 Sat 06:53</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
